int main()
{
    char c{ '1' };                   // символ
    bool b{ true };                  // логическая переменная
    int i{ 42 };                     // целое число
    short int si{ 17 };              // короткое целое
    //long li{ 12'321'321'312 };       // длинное целое
    long li = 12'321'321'312;        // длинное целое
    long long lli{ 12'321'321'312 }; // двойное длинное целое
    float f{ 2.71828 };              // дробное число
    double d{ 3.141592 };            // дробное число двойной точности
    long double ld{ 1e15 };          // дробное число расширенной точности
}